[M_Sage_BorokCage MissionDefinition]
MissionDescription="Documentary artist Dietmar von Heinrich Zimmerschnitt is the subject of his documentary film. He wants to find and capture a creature called "Der Monstrosit".."
TurnInDescription="''Von Heinrich Zimmerschnitt is not actually his real name. His last name has so many syllables that if he doesn't say it yet you'll be hungry.."
TeaserText="Art needs suffering, but not you."
